example_before.xml

<?xml version="1.0" encoding="UTF-8" ?>
<soap-env:Envelope xmlns:soap-env="http://www.w3.org/2003/05/soap-envelope">
  <soap-env:Header>
    <aml-session:Session xmlns:aml-session="http://www.cisco.com/2004/01/aml-session"
    soap-env:mustUnderstand="true"
    soap-env:role="http://www.w3.org/2003/05/soap-envelope/role/next">
      <aml-session:To>http://tools.cisco.com/neddce/services/DDCEService</aml-session:To>
      <aml-session:Path>
        <aml-session:Via>http://www.cisco.com/appliance/uri</aml-session:Via>
      </aml-session:Path>
      <aml-session:From>http://www.cisco.com/appliance/uri</aml-session:From>
      <aml-session:MessageId>1004:TXX12345678:478F82E6</aml-session:MessageId>
    </aml-session:Session>
  </soap-env:Header>
  <soap-env:Body>
    <aml-block:Block xmlns:aml-block="http://www.cisco.com/2004/01/aml-block">
      <aml-block:Header>
        <aml-block:Type>http://www.cisco.com/2005/05/callhome/syslog</aml-block:Type>
        <aml-block:CreationDate>2008-01-17 16:31:33 GMT+0000</aml-block:CreationDate>
        <aml-block:Builder>
          <aml-block:Name>DC3</aml-block:Name>
          <aml-block:Version>4.1</aml-block:Version>
        </aml-block:Builder>
        <aml-block:BlockGroup>
          <aml-block:GroupId>1005:TXX12345678:478F82E6</aml-block:GroupId>
          <aml-block:Number>0</aml-block:Number>
          <aml-block:IsLast>true</aml-block:IsLast>
          <aml-block:IsPrimary>true</aml-block:IsPrimary>
          <aml-block:WaitForPrimary>false</aml-block:WaitForPrimary>
        </aml-block:BlockGroup>
        <aml-block:Severity>5</aml-block:Severity>
      </aml-block:Header>
      <aml-block:Content>
        <ch:CallHome xmlns:ch="http://www.cisco.com/2005/05/callhome" version="1.0">
          <ch:EventTime>2008-01-17 16:31:33 GMT+0000</ch:EventTime>
          <ch:MessageDescription>
            SYSLOG_ALERT 2008 Jan 17 16:31:33 dc3-test %ETHPORT-2-IF_SEQ_ERROR:
            Error (0x20) while communicating with component MTS_SAP_ELTM
            opcode:MTS_OPC_ETHPM_PORT_PHY_CLEANUP (for:RID_PORT: Ethernet3/1)
          </ch:MessageDescription>
          <ch:Event>
            <ch:Type>syslog</ch:Type>
            <ch:SubType></ch:SubType>
            <ch:Brand>Cisco</ch:Brand>
            <ch:Series>Nexus7000</ch:Series>
          </ch:Event>
          <ch:CustomerData>
            <ch:UserData>
              <ch:Email>contact@example.com</ch:Email>
            </ch:UserData>
            <ch:ContractData>
              <ch:DeviceId>N7K-C7010@C@TXX12345678</ch:DeviceId>
            </ch:ContractData>
            <ch:SystemInfo>
              <ch:Name>dc3-test</ch:Name>
              <ch:Contact>Jay Tester</ch:Contact>
              <ch:ContactEmail>contact@example.com</ch:ContactEmail>
              <ch:ContactPhoneNumber>+91-80-1234-5678</ch:ContactPhoneNumber>
              <ch:StreetAddress>#1, Any Street</ch:StreetAddress>
            </ch:SystemInfo>
          </ch:CustomerData>
          <ch:Device>
            <rme:Chassis xmlns:rme="http://www.cisco.com/rme/4.1">
              <rme:Model>N7K-C7010</rme:Model>
              <rme:HardwareVersion>0.405</rme:HardwareVersion>
              <rme:SerialNumber>TXX12345678</rme:SerialNumber>
            </rme:Chassis>
          </ch:Device>
        </ch:CallHome>
      </aml-block:Content>
      <aml-block:Attachments>
        <aml-block:Attachment type="inline">
          <aml-block:Name>show logging logfile | tail -n 200</aml-block:Name>
          <aml-block:Data
encoding="plain">
            <![CDATA[2008 Jan 17 10:57:51 dc3-test %SYSLOG-1-SYSTEM_MSG : Logging logfile (messages) 
cleared by user
2008 Jan 17 10:57:53 dc3-test %VSHD-5-VSHD_SYSLOG_CONFIG_I: Configuring console from 
/dev/ttyS0 /dev/ttyS0_console
2008 Jan 17 10:58:35 dc3-test %VSHD-5-VSHD_SYSLOG_CONFIG_I: Configuring console from 
/dev/ttyS0 /dev/ttyS0_console
2008 Jan 17 10:59:00 dc3-test %DAEMON-3-SYSTEM_MSG: error: setsockopt IP_TOS 16: Invalid 
argument: - sshd[14484]
2008 Jan 17 10:59:05 dc3-test %VSHD-5-VSHD_SYSLOG_CONFIG_I: Configuring console from 
/dev/ttyS0 /dev/ttyS0_console
2008 Jan 17 12:11:18 dc3-test %SYSMGR-STANDBY-5-SUBPROC_TERMINATED: \"System Manager 
(gsync controller)\" (PID 12000) has finished with error code 
SYSMGR_EXITCODE_GSYNCFAILED_NONFATAL (12).
2008 Jan 17 16:28:03 dc3-test %VSHD-5-VSHD_SYSLOG_CONFIG_I: Configuring console from 
/dev/ttyS0 /dev/ttyS0_console
2008 Jan 17 16:28:44 dc3-test %SYSMGR-3-BASIC_TRACE: core_copy: PID 2579 with message Core 
not generated by system for eltm(0). WCOREDUMP(9) returned zero . 
2008 Jan 17 16:28:44 dc3-test %SYSMGR-2-SERVICE_CRASHED: Service \"eltm\" (PID 3504) 
hasn&apos;t caught signal 9 (no core).
2008 Jan 17 16:29:08 dc3-test %SYSMGR-3-BASIC_TRACE: core_copy: PID 2579 with message Core 
not generated by system for eltm(0). WCOREDUMP(9) returned zero . 
2008 Jan 17 16:29:08 dc3-test %SYSMGR-2-SERVICE_CRASHED: Service \"eltm\" (PID 23210) 
hasn&apos;t caught signal 9 (no core).
2008 Jan 17 16:29:17 dc3-test %SYSMGR-3-BASIC_TRACE: core_copy: PID 2579 with message Core 
not generated by system for eltm(0). WCOREDUMP(9) returned zero . 
2008 Jan 17 16:29:17 dc3-test %SYSMGR-2-SERVICE_CRASHED: Service \"eltm\" (PID 23294) 
hasn&apos;t caught signal 9 (no core).
2008 Jan 17 16:29:25 dc3-test %SYSMGR-2-HASWITCHOVER_PRE_START: This supervisor is 
becoming active (pre-start phase).
2008 Jan 17 16:29:25 dc3-test %SYSMGR-2-HASWITCHOVER_START: This supervisor is becoming 
active.
2008 Jan 17 16:29:26 dc3-test %USER-3-SYSTEM_MSG: crdcfg_get_srvinfo: mts_send failed - 
device_test
2008 Jan 17 16:29:27 dc3-test %NETSTACK-3-IP_UNK_MSG_MAJOR:  netstack [4336]  Unrecognized 
message from MRIB. Major type 1807
2008 Jan 17 16:29:27 dc3-test %IM-5-IM_INTF_STATE: mgmt0 is DOWN in vdc 1
2008 Jan 17 16:29:27 dc3-test %IM-5-IM_INTF_STATE: mgmt0 is DOWN in vdc 2
2008 Jan 17 16:29:27 dc3-test %IM-5-IM_INTF_STATE: mgmt0 is DOWN in vdc 3
2008 Jan 17 16:29:27 dc3-test %IM-5-IM_INTF_STATE: mgmt0 is DOWN in vdc 4
2008 Jan 17 16:29:28 dc3-test %SYSMGR-2-SWITCHOVER_OVER: Switchover completed.
2008 Jan 17 16:29:28 dc3-test %DAEMON-3-SYSTEM_MSG: ntp:socket family : 2  - ntpd[19045]
2008 Jan 17 16:29:28 dc3-test %DAEMON-3-SYSTEM_MSG: ntp:socket family : 10  - ntpd[19045]
2008 Jan 17 16:29:28 dc3-test %DAEMON-3-SYSTEM_MSG: ntp:ipv6 only defined - ntpd[19045]
2008 Jan 17 16:29:28 dc3-test %DAEMON-3-SYSTEM_MSG: ntp:bindv6 only defined - ntpd[19045]
2008 Jan 17 16:29:28 dc3-test %DAEMON-3-SYSTEM_MSG: ntp:socket family : 2  - ntpd[19045]
2008 Jan 17 16:29:28 dc3-test %DAEMON-3-SYSTEM_MSG: ntp:socket family : 0  - ntpd[19045]
2008 Jan 17 16:29:28 dc3-test %DAEMON-3-SYSTEM_MSG: ntp:socket family : 0  - ntpd[19045]
2008 Jan 17 16:29:28 dc3-test %NETSTACK-3-CLIENT_GET:  netstack [4336]  HA client filter 
recovery failed (0)
2008 Jan 17 16:29:28 dc3-test %NETSTACK-3-CLIENT_GET:  netstack [4336]  HA client filter 
recovery failed (0)
2008 Jan 17 16:29:29 dc3-test %DAEMON-3-SYSTEM_MSG: ssh disabled, removing - 
dcos-xinetd[19072]
2008 Jan 17 16:29:29 dc3-test %DAEMON-3-SYSTEM_MSG: Telnet disabled, removing - 
dcos-xinetd[19072]
2008 Jan 17 16:29:31 dc3-test %DAEMON-3-SYSTEM_MSG: Telnet disabled, removing - 
dcos-xinetd[19073]
2008 Jan 17 16:29:32 dc3-test %DAEMON-3-SYSTEM_MSG: ssh disabled, removing - 
dcos-xinetd[19079]
2008 Jan 17 16:29:32 dc3-test %DAEMON-3-SYSTEM_MSG: Telnet disabled, removing - 
dcos-xinetd[19079]
2008 Jan 17 16:29:34 dc3-test %IM-5-IM_INTF_STATE: mgmt0 is UP in vdc 1
2008 Jan 17 16:29:34 dc3-test %IM-5-IM_INTF_STATE: mgmt0 is UP in vdc 2
2008 Jan 17 16:29:34 dc3-test %IM-5-IM_INTF_STATE: mgmt0 is UP in vdc 3
2008 Jan 17 16:29:34 dc3-test %IM-5-IM_INTF_STATE: mgmt0 is UP in vdc 4
2008 Jan 17 16:29:34 dc3-test %DAEMON-3-SYSTEM_MSG: ssh disabled, removing - 
dcos-xinetd[19105]
2008 Jan 17 16:29:34 dc3-test %DAEMON-3-SYSTEM_MSG: Telnet disabled, removing - 
dcos-xinetd[19105]
2008 Jan 17 16:29:35 dc3-test %PLATFORM-2-PS_AC_IN_MISSING: Power supply 2 present but all 
AC inputs are not connected, ac-redundancy might be affected
2008 Jan 17 16:29:35 dc3-test %PLATFORM-2-PS_AC_IN_MISSING: Power supply 3 present but all 
AC inputs are not connected, ac-redundancy might be affected
2008 Jan 17 16:29:38 dc3-test %CALLHOME-2-EVENT: SUP_FAILURE
2008 Jan 17 16:29:46 dc3-test vsh[19166]: CLIC-3-FAILED_EXEC: Can not exec command 
&lt;more&gt; return code &lt;14&gt;
2008 Jan 17 16:30:24 dc3-test vsh[23810]: CLIC-3-FAILED_EXEC: Can not exec command 
&lt;more&gt; return code &lt;14&gt;
2008 Jan 17 16:30:24 dc3-test vsh[23803]: CLIC-3-FAILED_EXEC: Can not exec command 
&lt;more&gt; return code &lt;14&gt;
2008 Jan 17 16:30:24 dc3-test vsh[23818]: CLIC-3-FAILED_EXEC: Can not exec command 
&lt;more&gt; return code &lt;14&gt;
2008 Jan 17 16:30:47 dc3-test %SYSMGR-3-BASIC_TRACE: core_copy: PID 2630 with message Core 
not generated by system for eltm(0). WCOREDUMP(9) returned zero . 
2008 Jan 17 16:30:47 dc3-test %SYSMGR-2-SERVICE_CRASHED: Service \"eltm\" (PID 4820) 
hasn&apos;t caught signal 9 (no core).
2008 Jan 17 16:31:02 dc3-test %SYSMGR-3-BASIC_TRACE: core_copy: PID 2630 with message Core 
not generated by system for eltm(0). WCOREDUMP(9) returned zero . 
2008 Jan 17 16:31:02 dc3-test %SYSMGR-2-SERVICE_CRASHED: Service \"eltm\" (PID 24239) 
hasn&apos;t caught signal 9 (no core).
2008 Jan 17 16:31:14 dc3-test %SYSMGR-3-BASIC_TRACE: core_copy: PID 2630 with message Core 
not generated by system for eltm(0). WCOREDUMP(9) returned zero . 
2008 Jan 17 16:31:14 dc3-test %SYSMGR-2-SERVICE_CRASHED: Service \"eltm\" (PID 24401) 
hasn&apos;t caught signal 9 (no core).
2008 Jan 17 16:31:23 dc3-test %CALLHOME-2-EVENT: SW_CRASH alert for service: eltm
2008 Jan 17 16:31:23 dc3-test %SYSMGR-3-BASIC_TRACE: core_copy: PID 2630 with message Core 
not generated by system for eltm(0). WCOREDUMP(9) returned zero . 
2008 Jan 17 16:31:23 dc3-test %SYSMGR-2-SERVICE_CRASHED: Service \"eltm\" (PID 24407) 
hasn&apos;t caught signal 9 (no core).
2008 Jan 17 16:31:24 dc3-test vsh[24532]: CLIC-3-FAILED_EXEC: Can not exec command 
&lt;more&gt; return code &lt;14&gt;
2008 Jan 17 16:31:24 dc3-test vsh[24548]: CLIC-3-FAILED_EXEC: Can not exec command 
&lt;more&gt; return code &lt;14&gt;
2008 Jan 17 16:31:24 dc3-test vsh[24535]: CLIC-3-FAILED_EXEC: Can not exec command 
&lt;more&gt; return code &lt;14&gt;
2008 Jan 17 16:31:33 dc3-test %NETSTACK-3-INTERNAL_ERROR:  netstack [4336]  (null)
2008 Jan 17 16:31:33 dc3-test %ETHPORT-2-IF_SEQ_ERROR: Error (0x20) while communicating 
with component MTS_SAP_ELTM opcode:MTS_OPC_ETHPM_PORT_PHY_CLEANUP (for:RID_PORT: 
Ethernet3/1) ]]>
          </aml-block:Data>
        </aml-block:Attachment>
        <aml-block:Attachment
type="inline">
          <aml-block:Name>show vdc membership</aml-block:Name>
          <aml-block:Data
encoding="plain">
            <![CDATA[
vdc_id: 1 vdc_name: dc3-test interfaces:
	Ethernet3/1           Ethernet3/2           Ethernet3/3           
	Ethernet3/4           Ethernet3/5           Ethernet3/6           
	Ethernet3/7           Ethernet3/8           Ethernet3/9           
	Ethernet3/10          Ethernet3/11          Ethernet3/12          
	Ethernet3/13          Ethernet3/14          Ethernet3/15          
	Ethernet3/16          Ethernet3/17          Ethernet3/18          
	Ethernet3/19          Ethernet3/20          Ethernet3/21          
	Ethernet3/22          Ethernet3/23          Ethernet3/24          
	Ethernet3/25          Ethernet3/26          Ethernet3/27          
	Ethernet3/28          Ethernet3/29          Ethernet3/30          
	Ethernet3/31          Ethernet3/32          Ethernet3/33          
	Ethernet3/34          Ethernet3/35          Ethernet3/36          
	Ethernet3/37          Ethernet3/38          Ethernet3/39          
	Ethernet3/40          Ethernet3/41          Ethernet3/42          
	Ethernet3/43          Ethernet3/44          Ethernet3/45          
	Ethernet3/46          Ethernet3/47          Ethernet3/48          

vdc_id: 2 vdc_name: dc3-aaa interfaces:

vdc_id: 3 vdc_name: dc3-rbac interfaces:

vdc_id: 4 vdc_name: dc3-call interfaces:



]]>
          </aml-block:Data>
        </aml-block:Attachment>
        <aml-block:Attachment type="inline">
          <aml-block:Name>show vdc current-vdc</aml-block:Name>
          <aml-block:Data encoding="plain">
            <![CDATA[Current vdc is 1 - dc3-test ]]>
          </aml-block:Data>
        </aml-block:Attachment>
        <aml-block:Attachment type="inline">
          <aml-block:Name>show license usage</aml-block:Name>
          <aml-block:Data encoding="plain">
            <![CDATA[Feature                      Ins  Lic   Status Expiry Date Comments
                                 Count
--------------------------------------------------------------------------------
LAN_ADVANCED_SERVICES_PKG     Yes   -   In use Never       -
LAN_ENTERPRISE_SERVICES_PKG   Yes   -   Unused Never       -
--------------------------------------------------------------------------------
]]>
          </aml-block:Data>
        </aml-block:Attachment>
      </aml-block:Attachments>
    </aml-block:Block>
  </soap-env:Body>
</soap-env:Envelope>

